###################################################################

# Created by write_sdc on Mon Jun 10 13:54:50 2024

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
set_driving_cell -lib_cell INVX1 [get_ports clk]
set_driving_cell -lib_cell INVX1 [get_ports rst_n]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[7][7]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[7][6]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[7][5]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[7][4]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[7][3]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[7][2]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[7][1]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[7][0]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[6][7]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[6][6]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[6][5]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[6][4]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[6][3]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[6][2]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[6][1]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[6][0]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[5][7]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[5][6]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[5][5]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[5][4]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[5][3]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[5][2]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[5][1]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[5][0]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[4][7]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[4][6]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[4][5]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[4][4]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[4][3]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[4][2]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[4][1]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[4][0]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[3][7]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[3][6]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[3][5]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[3][4]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[3][3]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[3][2]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[3][1]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[3][0]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[2][7]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[2][6]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[2][5]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[2][4]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[2][3]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[2][2]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[2][1]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[2][0]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[1][7]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[1][6]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[1][5]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[1][4]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[1][3]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[1][2]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[1][1]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[1][0]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[0][7]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[0][6]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[0][5]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[0][4]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[0][3]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[0][2]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[0][1]}]
set_driving_cell -lib_cell INVX1 [get_ports {Bxs[0][0]}]
create_clock [get_ports clk]  -period 2  -waveform {0 1}
set_input_delay -clock clk  0.1  [get_ports rst_n]
set_input_delay -clock clk  0.1  [get_ports {Bxs[7][7]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[7][6]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[7][5]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[7][4]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[7][3]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[7][2]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[7][1]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[7][0]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[6][7]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[6][6]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[6][5]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[6][4]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[6][3]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[6][2]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[6][1]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[6][0]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[5][7]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[5][6]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[5][5]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[5][4]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[5][3]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[5][2]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[5][1]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[5][0]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[4][7]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[4][6]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[4][5]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[4][4]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[4][3]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[4][2]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[4][1]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[4][0]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[3][7]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[3][6]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[3][5]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[3][4]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[3][3]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[3][2]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[3][1]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[3][0]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[2][7]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[2][6]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[2][5]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[2][4]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[2][3]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[2][2]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[2][1]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[2][0]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[1][7]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[1][6]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[1][5]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[1][4]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[1][3]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[1][2]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[1][1]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[1][0]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[0][7]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[0][6]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[0][5]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[0][4]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[0][3]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[0][2]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[0][1]}]
set_input_delay -clock clk  0.1  [get_ports {Bxs[0][0]}]
set_output_delay -clock clk  0.1  [get_ports done]
set_output_delay -clock clk  0.1  [get_ports {Xs[7]}]
set_output_delay -clock clk  0.1  [get_ports {Xs[6]}]
set_output_delay -clock clk  0.1  [get_ports {Xs[5]}]
set_output_delay -clock clk  0.1  [get_ports {Xs[4]}]
set_output_delay -clock clk  0.1  [get_ports {Xs[3]}]
set_output_delay -clock clk  0.1  [get_ports {Xs[2]}]
set_output_delay -clock clk  0.1  [get_ports {Xs[1]}]
set_output_delay -clock clk  0.1  [get_ports {Xs[0]}]
